app/views/teachers/show.html.erb


<% @teacher.courses.each do |course| %>
---
SELECT "courses".* FROM "courses" WHERE "courses"."teacher_id" = 1