app/views/courses/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."course_id" = 1
---

<% @course.posts.each do |post| %>