app/controllers/courses_controller.rb

	def new
		@course = Course.new
		@teachers = Teacher.all
---
SELECT "teachers".* FROM "teachers"

	def create
		@course = Course.new(params[:course])
		if params[:teacher_name]
			@teacher = Teacher.find_or_create_by_name(params[:teacher_name])
		else
			@teacher = Teacher.find(params[:teacher])
		end
		@course.teacher = @teacher

		if @course.save
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "courses" ("created_at", "name", "section", "teacher_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 21 Nov 2013 18:41:21 UTC +00:00], ["name", "CPSC 212"], ["section", 1], ["teacher_id", 1], ["updated_at", Thu, 21 Nov 2013 18:41:21 UTC +00:00]]

	def edit
		@course = Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]

	def update
		@course = Course.find(params[:id])

		if @course.update_attributes(params[:course])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "courses" SET "section" = 12, "updated_at" = '2013-11-21 01:05:28.778712' WHERE "courses"."id" = 2

	def destroy
		@course = Course.find(params[:id])
		@course.destroy
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 2]]

	def show
		@course = Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]