app/controllers/posts_controller.rb

	def new
		@post = Post.new
		@courses = Course.all
---
SELECT "courses".* FROM "courses"

	def create
		@post = Post.new(params[:post])
		@course = Course.find(params[:course])
		@post.course = @course

		if @post.save
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "posts" ("course_id", "created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["course_id", 1], ["created_at", Thu, 21 Nov 2013 18:59:57 UTC +00:00], ["text", "tja;lksjdf;lajs;flduapoisdufopijzxcv"], ["title", "Post1"], ["updated_at", Thu, 21 Nov 2013 18:59:57 UTC +00:00]]

	def update
		@post = Post.find(params[:id])

		if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "text" = 'firstttttttttt', "updated_at" = '2013-11-21 01:04:38.611796' WHERE "posts"."id" = 2