app/controllers/teachers_controller.rb

INSERT INTO "teachers" ("created_at", "department", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 21 Nov 2013 14:41:47 UTC +00:00], ["department", "CS"], ["name", "Pargas"], ["updated_at", Thu, 21 Nov 2013 14:41:47 UTC +00:00]]
---
	def create
		@teacher = Teacher.new(params[:teacher])

		if @teacher.save

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
		@teacher = Teacher.find(params[:id])

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "teachers" SET "department" = 'CPSC', "updated_at" = '2013-11-21 14:41:57.619095' WHERE "teachers"."id" = 1
---
	def update
		@teacher = Teacher.find(params[:id])

		if @teacher.update_attributes(params[:teacher])

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "teachers" WHERE "teachers"."id" = ?  [["id", 1]]
---
	def destroy
		@teacher = Teacher.find(params[:id])
		@teacher.destroy

SELECT "teachers".* FROM "teachers" WHERE "teachers"."name" = 'z' LIMIT 1
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "1"]]
---
	def show
		if params[:name]
			logger.debug ">>>>>>>>------------>#{params[:name]}"
			@teacher = Teacher.find_by_name(params[:name])
			if !@teacher
				@teacher = Teacher.create(:name => params[:name])
			end
		else
			@teacher = Teacher.find(params[:id])

SELECT "teachers".* FROM "teachers"
---
	def index
		@teachers = Teacher.all