app/controllers/users_controller.rb

	def index
		@user = User.find_by_username(params[:username])
		@courses = @user.courses
		@teachers = []
		@courses.each do |course|
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'bahudso' LIMIT 1
SELECT "courses".* FROM "courses" INNER JOIN "courses_users" ON "courses"."id" = "courses_users"."course_id" WHERE "courses_users"."user_id" = 1